In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [2]:
average_age_df = pd.read_csv('classification/classification/Average Age by PUMA.zip', compression='zip')
average_sal_df = pd.read_csv('classification/classification/Average Salary (Full-Time Employees) by PUMA.zip', compression='zip')
average_tt_df = pd.read_csv('classification/classification/Average Travel Time by County.zip', compression='zip')
obesity_df = pd.read_csv('classification/classification/Data USA - Map of Obesity Prevalence by County.zip', compression='zip')
workforce_fulltime_df = pd.read_csv('classification/classification/Full-Time People in Workforce by PUMA.zip', compression='zip')
gini_df = pd.read_csv('classification/classification/GINI by PUMA.zip', compression='zip')
poverty_df = pd.read_csv('classification/classification/Map of Poverty Rate by MSA.zip', compression='zip')
uninsured_df = pd.read_csv('classification/classification/Percent Uninsured (Adults) by County.zip', compression='zip')
population_df = pd.read_csv('classification/classification/Population by MSA.zip', compression='zip')
rural_pop_df = pd.read_csv('classification/classification/Rural Population by County.zip', compression='zip')

Let's take a sneak peek at what these dataframes look like.

In [3]:
average_age_df.head()

,year,geo_name,geo,avg_age,avg_age_moe
0,2015,Lee County (South & West)--Barrier Islands Reg...,79500US1207101,49.4059,1.59668
1,2014,Lee County (South & West)--Barrier Islands Reg...,79500US1207101,47.8364,1.49067
2,2015,"Northfield & New Trier Townships PUMA, IL",79500US1703416,47.8236,1.01545
3,2014,Nassau County (Northwest)--North Hempstead Tow...,79500US3603201,47.7300,1.15876
4,2015,Nassau County (Northwest)--North Hempstead Tow...,79500US3603201,47.5434,1.32727

In [4]:
average_sal_df.head()

,year,geo_name,geo,avg_wage_ft,avg_wage_ft_moe
0,2014,"Fairfield, New Canaan, Wilton, Weston & Easton...",79500US0900101,170446.0,15394.5
1,2015,"Battery Park City, Greenwich Village & Soho PU...",79500US3603810,165112.0,13757.0
2,2015,"Fairfield, New Canaan, Wilton, Weston & Easton...",79500US0900101,159994.0,14260.8
3,2015,"Upper East Side PUMA, NY",79500US3603805,154766.0,16604.9
4,2014,"Battery Park City, Greenwich Village & Soho PU...",79500US3603810,153698.0,11882.0

In [5]:
average_tt_df.head()

   year             geo_name           geo  mean_commute_minutes
0  2015          Pike County  05000US42103               42.1331
1  2015     Bronx County, NY  05000US36005               41.6023
2  2015  Richmond County, NY  05000US36085               41.5824
3  2013   Charles County, MD  05000US24017               41.5622
4  2015    Queens County, NY  05000US36081               41.5550

In [6]:
obesity_df.head()

   year          geo_name           geo  adult_obesity
0  2015     Greene County  05000US01063          0.481
1  2017  Claiborne County  05000US28021          0.476
2  2016     Holmes County  05000US28051          0.466
3  2016    Lowndes County  05000US01085          0.464
4  2017     Greene County  05000US01063          0.463

In [7]:
workforce_fulltime_df.head()

,year,geo_name,geo,num_ppl_ft,num_ppl_ft_moe
0,2014,"Upper East Side PUMA, NY",79500US3603805,111187,8544.80
1,2014,"Dale City, Lake Ridge & Woodbridge PUMA, VA",79500US5151246,109545,6227.21
2,2015,"Norman, Oklahoma City (South) & Moore Cities P...",79500US4000900,106946,4752.15
3,2015,"Dale City, Lake Ridge & Woodbridge PUMA, VA",79500US5151246,105317,5301.98
4,2015,"Upper East Side PUMA, NY",79500US3603805,102028,7359.41

In [8]:
gini_df.head()

,year,geo_name,geo,gini
0,2015,Westchester County (Southeast) PUMA,79500US3603104,0.612156
1,2014,"Chapel Hill Town PUMA, NC",79500US3701400,0.603970
2,2014,Westchester County (Southeast) PUMA,79500US3603104,0.602431
3,2015,"Norwalk, Westport & Darien Towns PUMA, CT",79500US0900103,0.602188
4,2014,Nassau County (Northeast)--Oyster Bay Town (No...,79500US3603202,0.597974

In [9]:
poverty_df.head()

,year,geo_name,geo,income_below_poverty,pop_poverty_status,income_below_poverty.1,income_below_poverty_moe,pop_poverty_status.1,pop_poverty_status_moe
0,2015,"New York-Newark-Jersey City, NY-NJ-PA Metro Area",31000US35620,2810100.0,19629100.0,2810100.0,22160.0,19629100.0,3677.0
1,2014,"New York-Newark-Jersey City, NY-NJ-PA Metro Area",31000US35620,2781160.0,19514300.0,2781160.0,20507.0,19514300.0,3713.0
2,2013,"New York-Newark-Jersey City, NY-NJ-PA Metro Area",31000US35620,2697430.0,19368500.0,2697430.0,21424.0,19368500.0,3742.0
3,2014,"Los Angeles-Long Beach-Anaheim, CA Metro Area",31000US31080,2197570.0,12868700.0,2197570.0,18801.0,12868700.0,4252.0
4,2015,"Los Angeles-Long Beach-Anaheim, CA Metro Area",31000US31080,2195750.0,12964700.0,2195750.0,17888.0,12964700.0,3633.0

In [10]:
uninsured_df.head()

   year            geo_name           geo uninsured_adults
0  2015  Hidalgo County, TX  05000US48215            0.523
1  2016  Hidalgo County, TX  05000US48215            0.513
2  2015  Cameron County, TX  05000US48061            0.491
3  2015     Webb County, TX  05000US48479            0.483
4  2016  Cameron County, TX  05000US48061            0.475

In [11]:
population_df.head()

,year,geo_name,geo,pop,pop_moe,pop_rank
0,2015,"New York-Newark-Jersey City, NY-NJ-PA Metro Area",31000US35620,19979950,0,1.0
1,2014,"New York-Newark-Jersey City, NY-NJ-PA Metro Area",31000US35620,19865045,0,1.0
2,2013,"New York-Newark-Jersey City, NY-NJ-PA Metro Area",31000US35620,19716880,0,1.0
3,2015,"Los Angeles-Long Beach-Anaheim, CA Metro Area",31000US31080,13154457,0,2.0
4,2014,"Los Angeles-Long Beach-Anaheim, CA Metro Area",31000US31080,13060534,0,2.0

In [12]:
rural_pop_df.head()

   year         geo_name           geo  population_living_in_a_rural_area
0  2016    Kemper County  05000US28069                                1.0
1  2015    Kemper County  05000US28069                                1.0
2  2017    Kemper County  05000US28069                                1.0
3  2017  Walthall County  05000US28147                                1.0
4  2016  Walthall County  05000US28147                                1.0

List of all dataframes-

In [13]:
all_dfs = [average_age_df,average_sal_df,average_tt_df,obesity_df,workforce_fulltime_df,gini_df,poverty_df,uninsured_df,population_df,rural_pop_df]

In [14]:
len(all_dfs)

10

Concatenating them together to get an idea of the feature space.

In [15]:
master_concat = pd.concat(all_dfs,axis=0)

In [16]:
master_concat.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 62513 entries, 0 to 9417
Data columns (total 23 columns):
adult_obesity                        9418 non-null float64
avg_age                              4756 non-null float64
avg_age_moe                          4756 non-null float64
avg_wage_ft                          4756 non-null float64
avg_wage_ft_moe                      4756 non-null float64
geo                                  62513 non-null object
geo_name                             62513 non-null object
gini                                 4756 non-null float64
income_below_poverty                 2787 non-null float64
income_below_poverty.1               2787 non-null float64
income_below_poverty_moe             2787 non-null float64
mean_commute_minutes                 9661 non-null float64
num_ppl_ft                           4756 non-null float64
num_ppl_ft_moe                       4756 non-null float64
pop                                  2787 non-null float64
pop_moe                              2787 non-null float64
pop_poverty_status                   2787 non-null float64
pop_poverty_status.1                 2787 non-null float64
pop_poverty_status_moe               2787 non-null float64
pop_rank                             2787 non-null float64
population_living_in_a_rural_area    9418 non-null float64
uninsured_adults                     9418 non-null object
year                                 62513 non-null int64
dtypes: float64(19), int64(1), object(3)
memory usage: 11.4+ MB

In [17]:
len(master_concat.geo.unique())

6533

Looks like we have 6,533 unique geographies.

After analysis and trial & error, I do not have a clear idea about how to go about the classification task. 
### But I'm gonna describe my thought process.

In [37]:
master_concat.columns

Index(['adult_obesity', 'avg_age', 'avg_age_moe', 'avg_wage_ft',
       'avg_wage_ft_moe', 'geo_name', 'gini', 'income_below_poverty',
       'income_below_poverty.1', 'income_below_poverty_moe',
       'mean_commute_minutes', 'num_ppl_ft', 'num_ppl_ft_moe', 'pop',
       'pop_moe', 'pop_poverty_status', 'pop_poverty_status.1',
       'pop_poverty_status_moe', 'pop_rank',
       'population_living_in_a_rural_area', 'uninsured_adults', 'year'],
      dtype='object')

The master_concat dataframe has all the possible features for the classification model.

### Initially try to break down all the geographies by those that have data for at least a couple of years so that we know if that geography shows signs of development or not.

### Proceed to creating features for such geographies like 'Buy' and 'Sell'. A geography might have a 1 in the 'Buy' feature and 0 in 'Sell' if it exhibits potential for good investment. A geography might have 0 in 'Buy' and 1 in 'Sell' if it doesn't show any promise of good investment. A geographical location that has a 0 in both 'Buy' and 'Sell' implies that it should be considered as 'Hold'.

### A margin for what could be considered a 'good' investment still needs to be defined- for example: if a geo has population growth (>100,000) or an marginal increment in average salaries (>1000$), then it could be considered as a 'good' investment.

### Similar marginal windows of 'good' and 'bad' investments can be defined for other features like obesity, average age, commute time, poverty, income etc.

### In this scenario we're gonna end up with a dataframe that has <6533 rows (number of unique geos with at least a couple of years of data) and over 10 features/columns ('positive_pop_growth','salary_growth','obesity_factor' along with 'Buy' and 'Sell') : all of which are binary variables. They could either be 1 or 0 based on growth/change in the feature over the course of an year.

### We plug all these features into a classifer such as a simple Multinomial Logistic Regression model, K-Neighbors Classifier, Ridge Classifier or the classic Random Forest Classifier. These are going to be a multiclass classification models so the prediction labels will be 'Buy' and 'Sell' (with 0 for both implying 'Hold')

### Model tuning by finding the right set of hyperparamters with Grid Search to find the best set of paramters for the model and also ensuring that it performs well on unseen data by performing cross validation.

### Last but not the least - Evaluating the model based on the confusion matrix. Examing the ROC curve and computing the most optimal Area Under the curve of ROC in the quest to determine the best classifier.